app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])

    if(@post.update(post_params))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Очевидное и невероятное"], ["body", "Колобок повесился."], ["updated_at", "2020-08-14 08:47:23.025680"], ["id", 9]]

  def create
    # render plain: params[:post].inspect
    @post = Post.new(post_params)

    if(@post.save)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Anecdot 1"], ["body", "anecdot "], ["created_at", "2020-08-14 15:08:48.707121"], ["updated_at", "2020-08-14 15:08:48.707121"]]